"""
@author lingwh
@desc python 中的三种代码注释
@date 2026/6/5 16:43
"""

# 1. 单行注释: # + 空格 + 注释 ⭐⭐⭐⭐⭐
# python hello world示例程序！
print("hello world!")

# 2. 多行注释

# 2.1. 多行注释第一种: 多个单行注释组成一个多行注释 ⭐⭐⭐
# 我是多行注释第一行......
# 我是多行注释第二行......
# 我是多行注释第三行......
# 格式: 三个开始位置三个单引号，结束位置三个单引号，中间为注释内容
print("hello world!")

# 2.2. 多行注释第二种: 一对英文状态下三个单引号 ⭐
'''
我是多行注释第一行......
我是多行注释第二行......
我是多行注释第三行......
格式: 开始位置三个单引号，结束位置三个单引号，中间为注释内容
'''
print("hello world!")

# 2.3. 多行注释第三种: 一对英文状态下三个双引号 ⭐⭐⭐⭐⭐
"""
我是多行注释第一行......
我是多行注释第二行......
我是多行注释第三行......
格式: 开始位置三个双引号，结束位置三个双引号，中间为注释内容
"""
print("hello world!")