# -*- coding: utf-8 -*-
"""python 中的字符串切片

python切片语法说明 [start:end:step]
1. 左闭右开，包含start，不包含end
2. step为正数，正向截取，从左往右切；step为负数，反向截取，从右往左切。下标始终从左往右（正向索引0,1,2...，逆向索引-1,-2,-3...表示从右往左数的位置）
3. step的用法是 start + step
   [-6:-2:1] -> 从 -6 + 1 = -5 开始，每次 + 1
   [-6:-2:-1] -> 从 -6 - 1 = -7 开始，每次 - 1

:author: lingwh
:date: 2026/7/1 14:59
"""


"""
原字符串    a  b  c  d  e  f  g  h
正向索引    0  1  2  3  4  5  6  7
逆向索引   -8 -7 -6 -5 -4 -3 -2 -1 
"""
s = "abcdefgh"

# Python切片：左闭右开 [start:end]，包含start，不包含end
print("截取下标范围 0~1（不含1）：", s[0:1])
print("截取下标范围 2~5（不含5）：", s[2:5])
print("-" * 20)

print("截取下标范围 1~末尾：", s[1:])
print("截取下标范围 开头~3（不含3）：", s[:3])
print("截取下标范围 1~倒数第2位（不含-1）：", s[1:-1])
print("截取下标范围 1~倒数第3位（不含-2）：", s[1:-2])
print("截取下标范围 开头~倒数第3位（不含-2）：", s[:-2])
print("截取下标范围 最后两位：", s[-2:])
print("-" * 20)

# 带步长切片
# 省略开始和结束下标，切片步长为1
print("全串，步长1：", s[::1])
# 省略开始和结束下标，切片步长为2
# s[::2] 从左往右依次取下标：0 → 2 → 4 ->6，对应字符：a c e g
print("全串，正向步长2：", s[::2])
print("-" * 20)
# s[::-2] 从右往左依次取下标：6 -> 4 → 2 → 0，对应字符：h f d b
print("全串，逆向步长2：", s[::-2])
print("-" * 20)
# 负步长反向截取，步长为正数，从右往左切，步长为负数，从左往右切，不过这两种方式下标都是从左往右
print("反向截取 5~1：", s[5:1:-1])
print("截取下标范围 开始两位：", s[-8:-6:1])
print("无法截取到任何字符：", s[-8:-6:-1])
print("-" * 20)

# 字符串逆序
print("逆序字符串方式一：", s[::-1])
print("逆序字符串方式二：", s[-1::-1])
print("-" * 20)

# 字符串复制
s1 = s[0: len(s)]
print("复制字符串方式一：", s1)
s2 = s[:]
print("复制字符串方式二：", s2)
print("-" * 20)
